{
    "data":[
        {"title":"Raam", "creatorName":"Ameer","creatorPhoto":"https://www.filmibeat.com/img/560x80x292/popcorn/list_items/raam-20230428162645-1096.jpg","views":"3.2M", "videoLength":"2 hours", "description":"Jiiva appeared in the mystery-thriller film directed by Ameer, in which the mother-son bond between Jiiva and Saranya was still prevalent in Kollywood. He completely lives for his mother and resides in her shade. Because of the way that Jiiva carried over in there, Raam's character abruptly turned harsh after losing his mom."},
        {"title":"Sita Ram", "creatorName":"Unknown","creatorPhoto":"https://www.filmibeat.com/img/560x80x292/popcorn/list_items/sita-ramam-20230428162833-3393.jpg","views":"4.4M", "videoLength":"3.1 hours", "description":"Dulquer Salmaan is undoubtedly a Chocolate boy in the movie business, with a large following among youngsters all over India. Dulquer portrays Lieutenant Ram, a character who crushed the souls of young females. DQ and Mrunal Thakur have great on-screen chemistry and an impressive match."},
        {"title":"Three", "creatorName":"Dhanush","creatorPhoto":"https://www.filmibeat.com/img/560x80x292/popcorn/list_items/3-20230428162859-7724.jpg","views":"2.1M", "videoLength":"2.5 hours", "description":"Whatever you can tell, Dhanush and Shruti Haasan's performance is timeless and the best they have ever given. But no one will hesitate to acknowledge that Dhanush performed admirably from a young boy to a man. Raam became severely depressed from his bipolar disease after falling deeply in love with Janani."},
        {"title":"Panchathantiram", "creatorName":"Kamal Hassan","creatorPhoto":"https://upload.wikimedia.org/wikipedia/commons/thumb/3/3f/Kamal_haasan.jpg/220px-Kamal_haasan.jpg","views":"10M", "videoLength":"2 hours", "description":"When the previous four Rams' romantic relationships ended abruptly and their lives were not at peace with one another. However, this Raam, who plays Simran, Devayani, and Ramya Krishnan, was the best Ram character in the Kollywood industry. He was the most enjoyable and entertaining Raam. Ulazha Nayagan Kamal Hasan's entertaining encounters with the gang were once again evident in his sense of humour."},
        {"title":"Gunaa", "creatorName":"Santhana Bharathi","creatorPhoto":"https://upload.wikimedia.org/wikipedia/en/thumb/2/21/Gunaa_poster.jpg/220px-Gunaa_poster.jpg","views":"4M", "videoLength":"3 hours", "description":"Gunaa is a 1991 Indian Tamil-language psychological romantic drama film directed by Santhana Bharathi and co-written by Sab John. The film stars Kamal Haasan, Rekha and newcomer Roshini. It revolves around a newly released psychiatric patient (Haasan) who kidnaps an heiress (Roshini) to make her fall in love with him. He believes she is an avatar of goddess Abhirami and it is his destiny to marry her."},
        {"title":"Mahanadhi", "creatorName":"Santhana Bharathi","creatorPhoto":"https://upload.wikimedia.org/wikipedia/en/e/e7/Mahanadhi_film_poster.jpg","views":"11M", "videoLength":"2.6 hours", "description":"Mahanadhi is a 1994 Indian Tamil-language crime drama film directed by Santhana Bharathi and co-written by Kamal Haasan. The film stars Haasan and Sukanya, with S. N. Lakshmi, Tulasi, Shobana, Dinesh, Poornam Viswanathan, Rajesh and V. M. C. Haneefa in supporting roles. It revolves around a widower and his family going through many miseries due to the machinations of a con artist. "},
        {"title":"Nammavar", "creatorName":"K. S. Sethumadhavan","creatorPhoto":"https://upload.wikimedia.org/wikipedia/en/4/43/Nammavar_poster.jpg","views":"12M", "videoLength":"3 hours", "description":"Nammavar is a 1994 Indian Tamil-language drama film directed by K. S. Sethumadhavan and produced by B. Venkatarama Reddy. The film stars Kamal Haasan and Gautami, while Nagesh, Senthil, Kovai Sarala, Srividya and Karan play supporting roles. It follows a history lecturer of a college and how he tries to reform the downtrodden college by his initiatives and its consequences. "},
        {"title":"Kuruthipunal", "creatorName":"P. C. Sreeram","creatorPhoto":"https://upload.wikimedia.org/wikipedia/en/9/90/Kuruthipunal_film_poster.jpg","views":"15M", "videoLength":"3.1 hours", "description":"Kuruthipunal is a 1995 Indian Tamil-language action thriller film directed and filmed by P. C. Sreeram, and co-produced and written by Kamal Haasan. The film, which stars Haasan, Arjun, Nassar, Gautami and Geetha, is a remake of the Hindi film Drohkaal (1994), and revolves around two police officers seeking to curb a terrorist group. "},
        {"title":"Indian", "creatorName":"S. Shankar","creatorPhoto":"https://upload.wikimedia.org/wikipedia/en/6/65/Indian_1996_poster.jpg","views":"15M", "videoLength":"3 hours", "description":"Indian  is a 1996 Indian Tamil-language vigilante action film written and directed by Shankar and produced by A. M. Rathnam. The film stars Kamal Haasan in a dual role opposite Nedumudi Venu, Sukanya, Manisha Koirala and Urmila Matondkar. The music composed by A. R. Rahman, while cinematography was handled by Jeeva. The film focuses on an ex-freedom fighter turned vigilante bent on rooting out corruption, and his son, who is at the other end of the spectrum by facilitating corrupt practices leading to some unfortunate events. He is well trained in Varma Kalai, an ancient lethal martial art used for close-quarters combat.[1] "},
        {"title":"Hey Ram", "creatorName":"Kamal Hassan","creatorPhoto":"https://upload.wikimedia.org/wikipedia/en/c/ce/Hey_Ram.jpg","views":"100M", "videoLength":"2.9 hours", "description":"Hey Ram is a 2000 Indian Indian- period crime drama film written, directed and produced by Kamal Haasan. The film's soundtrack and score were composed by Ilaiyaraaja. It is an alternate history film that depicts India's Partition and the assassination of Mahatma Gandhi by Nathuram Godse. The Hindi version was distributed by Khan's Dreamz Unlimited."},
        
        {"title":"Thenali", "creatorName":"K. S. Ravikumar","creatorPhoto":"https://upload.wikimedia.org/wikipedia/commons/thumb/a/ad/K._S._Ravikumar_at_the_first_look_launch_of_%27Policegiri%27_%28cropped%29.jpg/220px-K._S._Ravikumar_at_the_first_look_launch_of_%27Policegiri%27_%28cropped%29.jpg","views":"10K", "videoLength":"3.1 hours", "description":"Thenali is a 2000 Indian Tamil-language comedy film co-written and directed by K. S. Ravikumar. The film stars Kamal Haasan, Jayaram, Devayani and Jyothika, with Delhi Ganesh, Charle, Ramesh Khanna and Madhan Bob in supporting roles. It revolves around the title character who follows his psychiatrist Kailash on vacation to cure his numerous phobias. When Thenali becomes closer to Kailash's family, Kailash becomes increasingly obsessed with getting rid of him. "},
        {"title":"Avvai Shanmugi", "creatorName":"K. S. Ravikumar","creatorPhoto":"https://upload.wikimedia.org/wikipedia/commons/thumb/a/ad/K._S._Ravikumar_at_the_first_look_launch_of_%27Policegiri%27_%28cropped%29.jpg/220px-K._S._Ravikumar_at_the_first_look_launch_of_%27Policegiri%27_%28cropped%29.jpg","views":"10K", "videoLength":"3.1 hours", "description":"Avvai Shanmugi is a 1996 Indian Tamil-language comedy film directed by K. S. Ravikumar and co-written by Crazy Mohan.[1] The film stars Kamal Haasan and Meena, with Gemini Ganesan, Nagesh, Heera, Manivannan, Nassar, Delhi Ganesh and Ann in supporting roles. Heavily inspired by the American film Mrs Doubtfire (1993), it revolves around a divorcé who disguises as a nanny to be close to his daughter, whose custody is only with his ex-wife. "},
        {"title":"Pammal K. Sambandam", "creatorName":"Moulee","creatorPhoto":"https://upload.wikimedia.org/wikipedia/en/f/f6/Pammal_K._Sambandam.jpg","views":"12M", "videoLength":"3.5 hours", "description":"Pammal K. Sambandam is a 2002 Indian Tamil-language comedy film directed by Moulee and scripted by Crazy Mohan. The film stars Kamal Haasan in the title role alongside Simran, Abbas and Sneha. The film was produced by P. L. Thenappan under Media Dreams, while Deva composed the music."},
        {"title":"Panchatanthiram", "creatorName":"K. S. Ravikumar","creatorPhoto":"https://upload.wikimedia.org/wikipedia/commons/thumb/a/ad/K._S._Ravikumar_at_the_first_look_launch_of_%27Policegiri%27_%28cropped%29.jpg/220px-K._S._Ravikumar_at_the_first_look_launch_of_%27Policegiri%27_%28cropped%29.jpg","views":"10K", "videoLength":"3.1 hours", "description":"Panchatanthiram is a 2002 Indian Tamil-language comedy film directed by K. S. Ravikumar and written with Kamal Haasan, with the dialogues by Crazy Mohan. The film stars Kamal Haasan, Jayaram, Ramesh Aravind, Sriman, Yugi Sethu, Simran and Ramya Krishnan with Urvashi, Aishwarya, Sanghavi, Vidhya Venkatesh, Devayani and Nagesh in supporting roles. "},
        {"title":"Anbe Sivam", "creatorName":"Sundar C.","creatorPhoto":"https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/Sundar_C_at_Muthina_Kathirikai_Audio_Launch.jpg/220px-Sundar_C_at_Muthina_Kathirikai_Audio_Launch.jpg","views":"15M", "videoLength":"3 hours", "description":"Anbe Sivam is a 2003 Indian Tamil-language comedy drama film directed by Sundar C. and produced by K. Muralitharan, V. Swaminathan and G. Venugopal under the banner of Lakshmi Movie Makers. The film was written by Kamal Haasan, and Madhan provided the dialogues. Anbe Sivam stars Haasan, Madhavan and Kiran Rathod, with Nassar, Santhana Bharathi, Seema and Uma Riyaz Khan playing supporting characters. The film tells the story of Nallasivam and Anbarasu, two men of contrasting personalities who undertake an unexpected journey from Bhubaneswar to Chennai. "},
        {"title":"Virumaandi", "creatorName":"Kamal Hassan","creatorPhoto":"https://upload.wikimedia.org/wikipedia/commons/thumb/3/3f/Kamal_haasan.jpg/220px-Kamal_haasan.jpg","views":"123M", "videoLength":"2.8 hours", "description":"Virumaandi is a 2004 Indian Tamil-language action drama film written, co-edited, produced, and directed by Kamal Haasan, who also performed in the title role. The film revolves around the interview of two prison inmates, firstly, Kothala Thevar's (Pasupathy) life sentence, and secondly, Virumaandi (Haasan), who is sentenced to be hanged. The criminals express how they feel about the direction that their lives have taken and how they have ended up where they are. The film's narrative is based on the Rashomon effect. The cast also includes Abhirami, Napoleon, Rohini Molleti, Shanmugarajan, and Nassar in pivotal roles. The film's score and soundtrack were composed by Ilaiyaraaja. The film won critical acclaim and was a commercial success at the box office. It also marked Rohini’s comeback film after an 8-year hiatus from acting."},
        {"title":"Vasool Raja MBBS", "creatorName":"Saran","creatorPhoto":"https://upload.wikimedia.org/wikipedia/en/thumb/6/64/Vasool_Raja_MBBS_Poster.jpg/220px-Vasool_Raja_MBBS_Poster.jpg","views":"112M", "videoLength":"3 hours", "description":"Vasool Raja MBBS is a 2004 Indian Tamil-language comedy drama film directed by Saran. It is a remake of the 2003 Hindi film Munna Bhai M.B.B.S.. The film stars Kamal Haasan in the title role, while Prabhu, Sneha, Prakash Raj, Nagesh, Rohini Hattangadi, Jayasurya, Malavika, Crazy Mohan, Lakshmi Bhaskaran and Karunas play supporting roles.It was released on 12 August 2004. "},
        {"title":"Vettaiyaadu Vilaiyaadu", "creatorName":"GVM","creatorPhoto":"https://upload.wikimedia.org/wikipedia/commons/thumb/1/1e/Gautham_Menon_at_Dhuruvangal_Pathinaaru_Success_Meet_%28cropped%29.jpg/220px-Gautham_Menon_at_Dhuruvangal_Pathinaaru_Success_Meet_%28cropped%29.jpg","views":"135M", "videoLength":"3 hours", "description":"Vettaiyaadu Vilaiyaadu is a 2006 Indian Tamil-language Neo noir action crime thriller film written and directed by Gautham Vasudev Menon. The film stars Kamal Haasan, Jyothika, and Kamalinee Mukherjee in prominent roles, while Prakash Raj, Daniel Balaji, and Salim Baig played supporting roles. It revolves around a police officer who tries to track down two serial killers. "},
        {"title":"Dasavathaaram", "creatorName":"K. S. Ravikumar","creatorPhoto":"https://upload.wikimedia.org/wikipedia/commons/thumb/a/ad/K._S._Ravikumar_at_the_first_look_launch_of_%27Policegiri%27_%28cropped%29.jpg/220px-K._S._Ravikumar_at_the_first_look_launch_of_%27Policegiri%27_%28cropped%29.jpg","views":"10K", "videoLength":"3.1 hours", "description":"Dasavathaaram is a 2008 Indian Tamil-language science fiction action film directed by K. S. Ravikumar. It stars Kamal Haasan, who also wrote the script, in ten distinct roles. Asin appears in double role, with Jaya Prada and Mallika Sherawat plays subsidiary roles. The plot of the film revolves around bringing together the lives of several individuals beginning with the 12th century and ending with the 21st century; the main person being a businessman, who develops a bio-weapon and makes sure that it is not acquired by a terrorist nation. Several other people also get involved in the process and all their stories connect after the striking of 2004 Indian Ocean earthquake and tsunami, thus bringing philosophical views into the picture. "},
        {"title":"Vishwaroopam", "creatorName":"Kamal Hassan","creatorPhoto":"https://upload.wikimedia.org/wikipedia/commons/thumb/3/3f/Kamal_haasan.jpg/220px-Kamal_haasan.jpg","views":"123M", "videoLength":"2.8 hours", "description":"Vishwaroopam is a 2013 Indian action spy film written, directed and produced by Kamal Haasan, who also enacts the lead role.The film has Rahul Bose, Shekhar Kapur, Pooja Kumar, Andrea Jeremiah and Jaideep Ahlawat in supporting roles. In the film, Nirupama, an ambitious woman studying in the US, marries a classical dancer, Viswanathan. On being suspicious of his behaviour, she hires a detective, who reveals his true identity and past. "}
    ]
}